app/views/bookmarks/index.html.erb

<% if current_user.movies.present? %>
---
SELECT "movies".* FROM "movies" INNER JOIN "bookmarks" ON "movies"."id" = "bookmarks"."movie_id" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]


    <% if !movie.vod_info.nil? and movie.vod_info.vod_services.size > 0 %>
      <% movie.vod_info.vod_services.each do |service| %>
---
SELECT "vod_services".* FROM "vod_services" WHERE "vod_services"."vod_info_id" = ?  [["vod_info_id", 2]]
SELECT  "vod_infos".* FROM "vod_infos" WHERE "vod_infos"."movie_id" = ? LIMIT ?  [["movie_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "vod_services" WHERE "vod_services"."vod_info_id" = ?  [["vod_info_id", 2]]