app/views/titles/index.html.erb

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."movie_id" = ? AND "bookmarks"."user_id" = ? LIMIT ?  [["movie_id", 4], ["user_id", 1], ["LIMIT", 1]]
---
    <% if user_signed_in? %>
      <% unless movie.bookmarks.find_by(user_id: current_user.id).nil?  %>

SELECT "vod_services".* FROM "vod_services" WHERE "vod_services"."vod_info_id" = ?  [["vod_info_id", 12]]
SELECT  "vod_infos".* FROM "vod_infos" WHERE "vod_infos"."movie_id" = ? LIMIT ?  [["movie_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "vod_services" WHERE "vod_services"."vod_info_id" = ?  [["vod_info_id", 2]]
SELECT  "vod_infos".* FROM "vod_infos" WHERE "vod_infos"."movie_id" = ? LIMIT ?  [["movie_id", 51], ["LIMIT", 1]]
SELECT "vod_services".* FROM "vod_services" WHERE "vod_services"."vod_info_id" = ?  [["vod_info_id", 2]]
---

<% if movie.vod_info.vod_services.size > 0 %>
<% services = "" %>
  <% movie.vod_info.vod_services.each do |service| %>