app/controllers/bookmarks_controller.rb

  def create
    movie_id = params[:movie_id]
    if user_signed_in?
      user = current_user
      bookmark = Bookmark.find_or_create_by(movie_id: movie_id, user_id: user.id)
      bookmark.user = user
      bookmark.movie = Movie.find(movie_id)
---
INSERT INTO "bookmarks" ("user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["movie_id", 4], ["created_at", "2018-12-11 12:08:29.026689"], ["updated_at", "2018-12-11 12:08:29.026689"]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."movie_id" = ? AND "bookmarks"."user_id" = ? LIMIT ?  [["movie_id", 4], ["user_id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def destroy
    movie_id = params[:movie_id]
    user=current_user
    if bookmark = Bookmark.find_by(movie_id: movie_id, user_id: user.id)
    bookmark.delete
---
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."movie_id" = ? AND "bookmarks"."user_id" = ? LIMIT ?  [["movie_id", 4], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]