app/models/movie.rb

  def self.search_and_get(name)
    # api検索
    encoded_url_string = URI.encode('https://api.themoviedb.org/3/search/movie?api_key=53ea4f986260fa27ae8ede7e3103c9d3&language=ja&query=' + name.to_s)
    url = URI(encoded_url_string)

    http = Net::HTTP.new(url.host, url.port)
    http.use_ssl = true
    http.verify_mode = OpenSSL::SSL::VERIFY_NONE

    request = Net::HTTP::Get.new(url)

    request.body = '{}'

    response = http.request(request)

    hash = JSON.parse(response.body)

    movies = []
    return movies if hash['results'].nil?
    hash['results'].each do |result|
      movie = find_or_create_by(title: result['title'])
      movie.title = result['title']
      movie.poster_path = result['poster_path']
      movie.overview = result['overview']
      movie.release_date = result['release_date']
      movie.save
---
INSERT INTO "movies" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "ウォーキング with ダイナソー"], ["created_at", "2018-12-07 06:54:49.614474"], ["updated_at", "2018-12-07 06:54:49.614474"]]
UPDATE "movies" SET "overview" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["overview", ""], ["updated_at", "2019-02-05 08:52:01.634380"], ["id", 89]]