app/models/vod_info.rb

  def self.search_and_save(name)
    options = Selenium::WebDriver::Chrome::Options.new
    options.add_argument('--headless')
    options.add_argument('--disable-gpu')

    driver = Selenium::WebDriver.for :chrome, options: options

    driver.navigate.to 'https://www.justwatch.com/jp/検索?q=' + name.to_s
    wait = Selenium::WebDriver::Wait.new(timeout: 300)

    wait.until { driver.find_element(:class, 'main-content__list-element') }
    driver.find_elements(:class, 'main-content__list-element').each do |movie_element|
      title = movie_element.find_element(:class, 'main-content__list-element__title').find_element(:tag_name, 'span').text
      movie = Movie.find_by(title: title)
      if !movie.nil?
      vod_info = find_or_create_by(title: title)
      vod_info.title = title
      vod_info.movie = movie
      vod_info.save
      unless movie_element.find_elements(:class, 'price-comparison__grid__row--stream').empty?
        movie_element.find_element(:class, 'price-comparison__grid__row--stream')
                     .find_elements(:class, 'price-comparison__grid__row__icon').each do |icon_element|
          service_name = icon_element.attribute('alt')
          vod_service = VodService.find_or_create_by(name: service_name, vod_info: vod_info)
---
SELECT  "vod_infos".* FROM "vod_infos" WHERE "vod_infos"."title" = ? LIMIT ?  [["title", "ウォーキング with ダイナソー"], ["LIMIT", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."title" = ? LIMIT ?  [["title", "ウォーキング・デッド"], ["LIMIT", 1]]
INSERT INTO "vod_infos" ("title", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ウォーキング with ダイナソー"], ["movie_id", 1], ["created_at", "2018-12-07 06:54:56.881530"], ["updated_at", "2018-12-07 06:54:56.881530"]]
INSERT INTO "vod_services" ("name", "vod_info_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "GYAO"], ["vod_info_id", 2], ["created_at", "2018-12-07 06:55:45.061075"], ["updated_at", "2018-12-07 06:55:45.061075"]]
SELECT  "vod_services".* FROM "vod_services" WHERE "vod_services"."name" = ? AND "vod_services"."vod_info_id" = ? LIMIT ?  [["name", "GYAO"], ["vod_info_id", 2], ["LIMIT", 1]]